app/controllers/lawyers_controller.rb

INSERT INTO `lawyers` (`status`, `city`, `updated_at`, `bar_number`, `admission_date`, `lawyer_name`, `created_at`) VALUES(NULL, NULL, '2010-05-20 12:00:27', NULL, NULL, 'Aarestad, Joan Elizabeth', '2010-05-20 12:00:27')
---
  def get_data
  url=RAILS_ROOT+"/public/bar_list.html"
  doc = Nokogiri::HTML(open(url))

  doc.css("tr").each do |line|
    if line.css('td').size ==5
      #parse to arr
      arr =[]
      line.css('td').each do |td|
         arr << td.content
      end
      # add to db
        begin
        law = Lawyer.new
          law.lawyer_name = arr[0].strip.split(',').reverse.join(' ').gsub(/'/,'') #Convert the lawyer names
          law.status = arr[1]
          law.bar_number = arr[2].to_i
          law.city = arr[3]
          law.admission_date =("1 "+ arr[4]).to_date #parse string to date
        law.save

SELECT * FROM `lawyers`
---
  def index
    @lawyers = Lawyer.all

SELECT * FROM `lawyers` WHERE (`lawyers`.`id` = 0)
---
  def show
    @lawyer = Lawyer.find(params[:id])

SELECT * FROM `lawyers` WHERE (`lawyers`.`id` = 0)
DELETE FROM `lawyers` WHERE `id` = 76
---
  def destroy
    @lawyer = Lawyer.find(params[:id])
    @lawyer.destroy

DELETE FROM `lawyers`
---
  def destroy_all
     Lawyer.delete_all